ASafeFurrPlace/SafeFurrPlace/app/controllers/announcements_controller.rb

  def edit
      @announcement = Announcement.find(params[:id])
---
SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT 1  [["id", 5]]

	def index
    	@announcement = Announcement.all
---
SELECT "announcements".* FROM "announcements"

	def show
    	@announcement = Announcement.find(params[:id])
---
SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT 1  [["id", 2]]

	def create
  		@announcement = Announcement.new(announcement_params)

  		if @announcement.save
---
INSERT INTO "announcements" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Meeting today at noon"], ["text", "There will be a meeting today at noon."], ["created_at", "2016-03-29 21:07:55.357073"], ["updated_at", "2016-03-29 21:07:55.357073"]]